Revit 2024 API
MacroManager.GetApplicationMacroSecurityOptions Method
 Gets the application macro security options.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static ApplicationMacroOptions GetApplicationMacroSecurityOptions(
	Application application
)
Visual Basic
Public Shared Function GetApplicationMacroSecurityOptions ( _
	application As Application _
) As ApplicationMacroOptions
Visual C++
public:
static ApplicationMacroOptions GetApplicationMacroSecurityOptions(
	Application^ application
)
Parameters
application
Type: Autodesk.Revit.ApplicationServices.Application
 The application.
Return Value
 Returns the application macro security options.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
MacroManager Class
Autodesk.Revit.DB.Macros Namespace